week-05/day-02/moma/app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "nationality", "period", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Kenny D"], ["nationality", "Aussie"], ["period", ""], ["image", ""], ["created_at", "2019-04-16 05:17:27.964363"], ["updated_at", "2019-04-16 05:17:27.964363"]]
---
	def create
		artist = Artist.create artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
	def edit
		@artist = Artist.find params[:id]

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "artists" SET "dob" = ?, "updated_at" = ? WHERE "artists"."id" = ?  [["dob", "1788-01-26"], ["updated_at", "2019-04-16 05:33:19.393344"], ["id", 8]]
---
	def update
		artist = Artist.find params[:id]
		artist.update artist_params

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = ?  [["id", 8]]
---
	def destroy
		artist = Artist.find params[:id]
		artist.destroy