week-05/day-02/moma/app/controllers/works_controller.rb

SELECT "works".* FROM "works"
---
	def index
		@works = Work.all

SELECT  "works".* FROM "works" WHERE "works"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@work = Work.find params[:id]