08-rails/library_app/app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "nationality", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Thomas"], ["nationality", "Australia"], ["image", ""], ["created_at", "2019-04-17 10:51:25.618242"], ["updated_at", "2019-04-17 10:51:25.618242"]]
---
	def create
		author = Author.create author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
	def show
		@author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
	def edit
		@author = Author.find params[:id]

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "J R. R. Tolkiens"], ["updated_at", "2019-04-17 11:07:16.921378"], ["id", 3]]
---
	def update
		author = Author.find params[:id]
		author.update author_params

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 6]]
---
	def destroy
		author = Author.find params[:id]
		author.destroy